 //Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.

Console.WriteLine("Enter tne number: ");
int number = int.Parse(Console.ReadLine());